tap "adoptopenjdk/openjdk"
tap "coursier/formulas"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "scalacenter/bloop"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# High performance key/value database
brew "berkeley-db", link: true
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Reimplementation of ctags(1)
brew "ctags"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Kubernetes package manager
brew "helm"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Run a Kubernetes cluster locally
brew "minikube", link: false
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk@17"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Source-code syntax highlighter
brew "source-highlight"
# Cross-shell prompt for astronauts
brew "starship"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Tools for building Android applications
cask "android-studio"
# Tool to hide status bar icons
cask "dozer"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code"
cask "font-iosevka-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Java IDE by JetBrains
cask "intellij-idea"
# Clipboard manager
cask "maccy"
# Collaboration platform for API development
cask "postman"
vscode "alefragnani.project-manager"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-yaml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "thekalinga.bootstrap4-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wix.glean"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
