tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.11"
brew "asciinema"
brew "coursier"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "git"
brew "glow"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "lazygit"
brew "n"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "tmux"
brew "wireguard-tools"
brew "yt-dlp"
brew "zoxide"
brew "derailed/k9s/k9s"
cask "android-studio"
cask "blender"
cask "chromium"
cask "firefox-developer-edition"
cask "font-iosevka-nerd-font"
cask "freecad"
cask "maccy"
cask "mullvadvpn"
cask "raspberry-pi-imager"
