tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "asciinema"
brew "coursier"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "git"
brew "git-lfs"
brew "glow"
brew "htop"
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "lazygit"
brew "luajit"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "nvm"
brew "openssl@1.1"
brew "python@3.11"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "starship"
brew "tmux"
brew "wireguard-tools"
brew "yt-dlp"
brew "zoxide"
brew "derailed/k9s/k9s"
cask "android-studio"
cask "balenaetcher"
cask "bambu-studio"
cask "blender"
cask "chromium"
cask "discord"
cask "firefox-developer-edition"
cask "font-iosevka-nerd-font"
cask "maccy"
cask "mullvadvpn"
cask "obs"
cask "ocenaudio"
cask "openscad"
cask "raspberry-pi-imager"
cask "steam"
cask "utm"
cask "whisky"
